# ccClub: Python for Data Analysis
---
## Introduction to Pandas

## Overview

- How to Represent Data?
- Pandas & DataFrame
- Data Selection: Indexing & Slicing
- Data Operation: Basics & Concate
- Merging Data
- Exericse

### Install Pandas package

>```text
pip3 install pandas
```

# Part 1: How to Represent Data?

- We have introduced NumPy in the past 2 weeks. It seems like we can use NumPy to represent our data.
- For example, the grades data: 

```python
grades           
           classA  classB  classC
Midterm1 [[   67     55      72]
Midterm2  [   89     75      95]
Final     [   79     64      86]]

```

### Representation 1. [Two-way contigency table](https://en.wikipedia.org/wiki/Contingency_table).

|              | ClassA  | ClassB | ClassC |
|-------------:|:-------:|:------:|:-------:
| **Midterm1** |    67   |   55   |   72   |
| **Midterm2** |    89   |   75   |   95   |
| **Final**    |    79   |   64   |   86   |

In [1]:
import numpy as np
grades = np.array([[67, 55, 72],[89, 75, 95],[79, 64, 86]])
print(grades)

[[67 55 72]
 [89 75 95]
 [79 64 86]]

### However, what if we have grades data for many subjects?

```python
English grades 
           classA  classB  classC
Midterm1 [[   67     55      72]
Midterm2  [   89     75      95]
Final     [   79     64      86]]


Math grades
           classA  classB  classC
Midterm1 [[   73     81      45]
Midterm2  [   50     95      58]
Final     [   97     74      66]]
```

### We may want to represent our data more like this:

| Class | Midterm1 | Midterm2 | Final | Subject 
| ----- | -------- | -------- | ----- | -------
| A     | 67       | 89       | 79    | English
| B     | 55       | 75       | 64    | English
| C     | 72       | 95       | 86    | English
| A     | 73       | 50       | 97    | Math
| B     | 81       | 95       | 74    | Math
| C     | 45       | 58       | 66    | Math

### Representation 2. Data Frame or 2-D Table

1. each column represents a **_variable_**
2. each row represents an **_observation_**
3. each entry of the table represents a single **_value_**

![R for Data Science](http://r4ds.had.co.nz/images/tidy-1.png)

# Part 2: Say Hi to Pandas

![pandas](http://www.telegraph.co.uk/content/dam/news/2016/08/23/106598324PandawaveNEWS_trans_NvBQzQNjv4Bqeo_i_u9APj8RuoebjoAHt0k9u7HhRJvuo-ZLenGRumA.jpg?imwidth=450)

# Pandas & DataFrame

- According to the Wikipedia, “the name is derived from the term '[panel data](https://en.wikipedia.org/wiki/Panel_data)', an [econometrics](https://en.wikipedia.org/wiki/Econometrics) term for multidimensional structured data sets.”
- Pandas is package built on top of Numpy that allows us to work on multidimensional data easily.
- In pandas, there are 3 fundamental data structures: **Series, Index & DataFrame**.
- We'll focus on DataFrame here only.

**You can learn more about Pandas here: http://pandas.pydata.org/**

In [2]:
import pandas as pd
pd.__version__

'0.19.2'

## 2-1: DataFrame

- DataFrame is very similar to a table or you can think of it as an Excel sheet.
- You can store data with heterogenous types (even missing data).
- In a dataframe, we will have columns and rows. 
- Columns and rows (indexs) can also have associated labels as their name.

### Use  `.DataFrame()` to create a DataFrame

In [3]:
# Create dataframe from numpy array

print('NumPy array:\n', grades)
print('\nPandas DataFrame:')
display(pd.DataFrame(grades))

NumPy array:
 [[67 55 72]
 [89 75 95]
 [79 64 86]]

Pandas DataFrame:

    0   1   2
0  67  55  72
1  89  75  95
2  79  64  86

### Create DataFrame with columns and rows labels

In [4]:
# give labels for columns and rows

grades = pd.DataFrame(grades, 
                      columns=['classA', 'classB', 'classC'], 
                      index=['Midterm1', 'Midterm2', 'Final'])
grades

          classA  classB  classC
Midterm1      67      55      72
Midterm2      89      75      95
Final         79      64      86

### Use `.columns` and `.index` to access the the labels

In [5]:
# get columns and index names

print('Column names:', grades.columns)
print('Index names:', grades.index)

Column names: Index(['classA', 'classB', 'classC'], dtype='object')
Index names: Index(['Midterm1', 'Midterm2', 'Final'], dtype='object')

### Set column and index names via `.columns` or `.index`.

In [6]:
# copy the grades dataframe
grades_demo = grades.copy()

grades_demo.columns = ['Class_A', 'Class_B', 'Class_C']
grades_demo.index = ['Midterm_1', 'Midterm_2', 'Midterm_3']

display(grades_demo)

           Class_A  Class_B  Class_C
Midterm_1       67       55       72
Midterm_2       89       75       95
Midterm_3       79       64       86

### Create DataFrame using Dictionary Style

In [7]:
# Create two dataframes

users_plan = pd.DataFrame({'User': ['Kevin', 'Belle', '國維', '黃和', 'Alicia'],
                    'Plan': ['family plan', 'individual plan', 'individual plan', 'free', 'free']})
users_join = pd.DataFrame({'User': ['Kevin', 'Belle', '國維', '黃和', 'Alicia'],
                    'JoinYear': [2013, 2014, 2015, 2016, 2017]})

display(users_plan, users_join)

              Plan    User
0      family plan   Kevin
1  individual plan   Belle
2  individual plan      國維
3             free      黃和
4             free  Alicia

   JoinYear    User
0      2013   Kevin
1      2014   Belle
2      2015      國維
3      2016      黃和
4      2017  Alicia

## 2-2: Read in Data from .CSV file

- In the real world, our data may be stored in excel.
- We can read in data from excel `.csv` file very easily using **`.read_csv()`** function.

In [9]:
# read data with header

highschool_grades = pd.read_csv('data/highschool_grades.csv')
highschool_grades

  Class  Midterm1  Midterm2  Final  Subject
0     A        67        89     79  English
1     B        55        75     64  English
2     C        72        95     86  English
3     A        73        50     97     Math
4     B        81        95     74     Math
5     C        45        58     66     Math
6     A        73        63     93  Science
7     B        57        86     64  Science
8     C        83        59     58  Science

In [11]:
# read data without header

pd.read_csv('data/highschool_grades.csv', header=None)

       0         1         2      3        4
0  Class  Midterm1  Midterm2  Final  Subject
1      A        67        89     79  English
2      B        55        75     64  English
3      C        72        95     86  English
4      A        73        50     97     Math
5      B        81        95     74     Math
6      C        45        58     66     Math
7      A        73        63     93  Science
8      B        57        86     64  Science
9      C        83        59     58  Science

### Inspect DataFrame

- Use `.head()` or `.tail()` to inspect your data.
- List top 5 or last 5 by default, but you can also specify a number.

In [12]:
highschool_grades.head()

  Class  Midterm1  Midterm2  Final  Subject
0     A        67        89     79  English
1     B        55        75     64  English
2     C        72        95     86  English
3     A        73        50     97     Math
4     B        81        95     74     Math

In [13]:
highschool_grades.tail(1)

  Class  Midterm1  Midterm2  Final  Subject
8     C        83        59     58  Science

# Part 3: Data Selection: Indexing & Slicing

## 3-1: Select Column
- In Pandas, we usually view the data column-wise.
- We can use `[]` to access data in column. It is similar to access value in a dictionary.
- We can also use `.<column name>` to access the data.

In [14]:
# get column 'Class'
print(highschool_grades['Class'], '\n')

# unique value in 'Class'
print('We have grades in these class:', highschool_grades['Class'].unique())

0    A
1    B
2    C
3    A
4    B
5    C
6    A
7    B
8    C
Name: Class, dtype: object

We have grades in these class: ['A' 'B' 'C']

In [15]:
# get column 'Subject'
print(highschool_grades.Subject, '\n')

# unique value in 'Subject'
print('We have grades in these subject:', highschool_grades.Subject.unique())

0    English
1    English
2    English
3       Math
4       Math
5       Math
6    Science
7    Science
8    Science
Name: Subject, dtype: object

We have grades in these subject: ['English' 'Math' 'Science']

## 3-2: Add column

- We can also add new column to the DataFrame using `[]`.
- And perform element-wise operation very easily with DataFrame.

In [16]:
# add new column
highschool_grades['Total'] = (highschool_grades['Midterm1'] 
                              + highschool_grades['Midterm2'] 
                              + highschool_grades['Final'])
highschool_grades

  Class  Midterm1  Midterm2  Final  Subject  Total
0     A        67        89     79  English    235
1     B        55        75     64  English    194
2     C        72        95     86  English    253
3     A        73        50     97     Math    220
4     B        81        95     74     Math    250
5     C        45        58     66     Math    169
6     A        73        63     93  Science    229
7     B        57        86     64  Science    207
8     C        83        59     58  Science    200

## 3-3: Array-style Indexing & Slicing

- We can index row and column just like what we did with NumPy.
- In Pandas, we usually use `iloc` & `loc` indexer.
- **`iloc`** uses implicit index just like NumPy.
- **`loc`** uses explicit index, the labels that we give for columns or rows.

### Implicit Indexing

In [17]:
# grades dataframe
display(grades)

# implicit indexing
display(grades.iloc[0, 0])      # value of the first column, first row
display(grades.iloc[:, 0])      # the first column
display(grades.iloc[0, :])      # the first row

          classA  classB  classC
Midterm1      67      55      72
Midterm2      89      75      95
Final         79      64      86

67

Midterm1    67
Midterm2    89
Final       79
Name: classA, dtype: int64

classA    67
classB    55
classC    72
Name: Midterm1, dtype: int64

### Implicit Slicing

In [18]:
# implicit slicing
display(grades.iloc[: , :2])     # the first two columns
display(grades.iloc[:2, 1:])     # the first two rows and the last two columns

          classA  classB
Midterm1      67      55
Midterm2      89      75
Final         79      64

          classB  classC
Midterm1      55      72
Midterm2      75      95

### Explicit Indexing

In [19]:
display(grades)

# explicit indexing
display(grades.loc['Midterm1', 'classA'])   # vlaue of the first column, first row
display(grades.loc[: ,'classA'])            # the first column
display(grades.loc['Final', :])             # the last row

          classA  classB  classC
Midterm1      67      55      72
Midterm2      89      75      95
Final         79      64      86

67

Midterm1    67
Midterm2    89
Final       79
Name: classA, dtype: int64

classA    79
classB    64
classC    86
Name: Final, dtype: int64

### Explicit Slicing

- When indexing multiple columns or rows that are not consequtive, we need to put them into the `[]`.
- When indexing consecutive columns or rows, we can use `[:]` to do the slicing.

In [20]:
# explicit slicing
display(grades.loc[:, ['classA', 'classC']])       # the first and the third column
display(grades.loc[['Midterm1', 'Final'], :])      # the first and the thrid row
display(grades.loc[:'Midterm2', :])                # the first two rows

          classA  classC
Midterm1      67      72
Midterm2      89      95
Final         79      86

          classA  classB  classC
Midterm1      67      55      72
Final         79      64      86

          classA  classB  classC
Midterm1      67      55      72
Midterm2      89      75      95

## 3-4: Boolean & Masking

- Like in NumPy, we can also perform boolean & maksing to filter the data.

### Boolean

In [21]:
display(grades)

          classA  classB  classC
Midterm1      67      55      72
Midterm2      89      75      95
Final         79      64      86

In [22]:
# boolean

print('\nFinal grades > 80:')
display(grades.loc['Final', :] > 80)

Final grades > 80:

classA    False
classB    False
classC     True
Name: Final, dtype: bool

### Filter our high school grades data

- We will use masking to filter our `"highschool_grades"` data.

In [23]:
display(highschool_grades)

  Class  Midterm1  Midterm2  Final  Subject  Total
0     A        67        89     79  English    235
1     B        55        75     64  English    194
2     C        72        95     86  English    253
3     A        73        50     97     Math    220
4     B        81        95     74     Math    250
5     C        45        58     66     Math    169
6     A        73        63     93  Science    229
7     B        57        86     64  Science    207
8     C        83        59     58  Science    200

### Masking

In [24]:
# Get grades for class A

classA = highschool_grades[highschool_grades.Class == 'A']

print('\nGrades for class A:')
display(classA)

Grades for class A:

  Class  Midterm1  Midterm2  Final  Subject  Total
0     A        67        89     79  English    235
3     A        73        50     97     Math    220
6     A        73        63     93  Science    229

In [25]:
# Get grades for English

English = highschool_grades[highschool_grades.Subject == 'English']

print('\nGrades for English:')
display(English)

Grades for English:

  Class  Midterm1  Midterm2  Final  Subject  Total
0     A        67        89     79  English    235
1     B        55        75     64  English    194
2     C        72        95     86  English    253

### Combing Boolean & Masking: Final grades lower than 60

In [26]:
# Get 'F' for final exam

display(highschool_grades.loc[highschool_grades.Final < 60, :])

print(highschool_grades.Final < 60)

  Class  Midterm1  Midterm2  Final  Subject  Total
8     C        83        59     58  Science    200

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
Name: Final, dtype: bool

# Part 4: Data Operation - Basics & Concatenation

- Just as in NumPy, we can perform element-wise operation very easily in Pandas.
- We can also convert data selected from DataFrame to NumPy array.
- We will also introduce more convenient ways to combine data.

## 4-1: Basic Operation

In [27]:
# average grades

highschool_grades['Avg'] = round(highschool_grades.Total / 3, 2)
display(highschool_grades)

  Class  Midterm1  Midterm2  Final  Subject  Total    Avg
0     A        67        89     79  English    235  78.33
1     B        55        75     64  English    194  64.67
2     C        72        95     86  English    253  84.33
3     A        73        50     97     Math    220  73.33
4     B        81        95     74     Math    250  83.33
5     C        45        58     66     Math    169  56.33
6     A        73        63     93  Science    229  76.33
7     B        57        86     64  Science    207  69.00
8     C        83        59     58  Science    200  66.67

### Preserve Index
- Pandas will take care of the indexes for us automatically. (ex. preserve labels).
- Pandas will match the index automatically to perform element-wise operation.
- Be careful of the index when selecting data. Sometimes we may need to reset the index.

In [28]:
classA_grades = highschool_grades.loc[highschool_grades.Class == 'A', ['Midterm1', 'Midterm2', 'Final']]
classB_grades = highschool_grades.loc[highschool_grades.Class == 'B', ['Midterm1', 'Midterm2', 'Final']]

# note that the original index is preserve
display(classA_grades, classB_grades)

# Indexs do not match
display(classA_grades + classB_grades)

   Midterm1  Midterm2  Final
0        67        89     79
3        73        50     97
6        73        63     93

   Midterm1  Midterm2  Final
1        55        75     64
4        81        95     74
7        57        86     64

   Midterm1  Midterm2  Final
0       NaN       NaN    NaN
1       NaN       NaN    NaN
3       NaN       NaN    NaN
4       NaN       NaN    NaN
6       NaN       NaN    NaN
7       NaN       NaN    NaN

In [29]:
# reset index
classA_grades = classA_grades.reset_index(drop = True)
classB_grades = classB_grades.reset_index(drop = True)

# Indexs match
display(classA_grades, classB_grades)
display(classA_grades + classB_grades)

   Midterm1  Midterm2  Final
0        67        89     79
1        73        50     97
2        73        63     93

   Midterm1  Midterm2  Final
0        55        75     64
1        81        95     74
2        57        86     64

   Midterm1  Midterm2  Final
0       122       164    143
1       154       145    171
2       130       149    157

### Convert Data to NumPy Array

- Use **`.values`** to convert data into a NumPy array.
- Or simpy use `np.array()` to explicitly convert the data.
- Now you can use all the operations that we have introduced last week.

In [30]:
# use .values
print(type(highschool_grades.Midterm1.values))

# use np.array()
print(type(np.array(highschool_grades.Midterm1)))

<class 'numpy.ndarray'>
<class 'numpy.ndarray'>

In [31]:
midterm1 = highschool_grades.Midterm1.values
print('Min score for midterm 1:', midterm1.min())
print('Average score for midterm 1:', round(midterm1.mean(), 2))
print('Max score for midterm 1:', midterm1.max())

Min score for midterm 1: 45
Average score for midterm 1: 67.33
Max score for midterm 1: 83

## 4-2: Combine Data - Concatenate

- The simplest way to combine two different dataset is to use `pd.concat()`.
- By default, `pd.concat()` operates **row-wise** with `DataFrame`. (`axis=0`)
- You can also specify an axis to concat.
    - `axis = 0` : row-wise
    - `axis = 1` : column-wise

### For example, we can use `pd.concat()` to combine the two np.array grades data.

In [32]:
# Create two grades dataframes

grades1 = np.array([[67, 55, 72],[89, 75, 95],[79, 64, 86]])
grades1 = pd.DataFrame(grades1, 
                      columns=['classA', 'classB', 'classC'], 
                      index=['Midterm1', 'Midterm2', 'Final'])

grades2 = np.array([[73, 81, 45], [50, 95, 58], [97, 74,66]])
grades2 = pd.DataFrame(grades2, 
                      columns=['classA', 'classB', 'classC'], 
                      index=['Midterm1', 'Midterm2', 'Final'])

display(grades1)

          classA  classB  classC
Midterm1      67      55      72
Midterm2      89      75      95
Final         79      64      86

In [33]:
# Add Subject column

grades1['Subject'] = 'English'
grades2['Subject'] = 'Math'
display(grades2)

          classA  classB  classC Subject
Midterm1      73      81      45    Math
Midterm2      50      95      58    Math
Final         97      74      66    Math

In [34]:
# combine two dataframe

combined_grades = pd.concat([grades1, grades2])
display(combined_grades)

          classA  classB  classC  Subject
Midterm1      67      55      72  English
Midterm2      89      75      95  English
Final         79      64      86  English
Midterm1      73      81      45     Math
Midterm2      50      95      58     Math
Final         97      74      66     Math

## 4-3: Handling index

### Duplicate indexes

- One important thing to notice is that Pandas preservers indexes when combining data.
- From the previous example, we see that there are duplicate indexes. (_Midterm1, Midterm2, Final_)
- If the indexes does not matter, we can ignore the indexes by specifying `ignore_index` argument.

In [35]:
display(combined_grades)

          classA  classB  classC  Subject
Midterm1      67      55      72  English
Midterm2      89      75      95  English
Final         79      64      86  English
Midterm1      73      81      45     Math
Midterm2      50      95      58     Math
Final         97      74      66     Math

### Reset index by specifying `ignore_index`.

In [36]:
# ignore index

display(pd.concat([grades1, grades2], ignore_index=True))

   classA  classB  classC  Subject
0      67      55      72  English
1      89      75      95  English
2      79      64      86  English
3      73      81      45     Math
4      50      95      58     Math
5      97      74      66     Math

### Reset index by `.reset_index()`

- By default, Pandas will insert the index labels into a column.
- It is useful when we want to reset the index and keep the index labels at the same time.

In [37]:
# reset index and keep the index
display(combined_grades.reset_index())

      index  classA  classB  classC  Subject
0  Midterm1      67      55      72  English
1  Midterm2      89      75      95  English
2     Final      79      64      86  English
3  Midterm1      73      81      45     Math
4  Midterm2      50      95      58     Math
5     Final      97      74      66     Math

### Drop the index

- If the labels is not useful, we can specify `drop = True` to drop the index and do not insert it back.

In [38]:
# reset index and drop the index
display(combined_grades.reset_index(drop=True))

   classA  classB  classC  Subject
0      67      55      72  English
1      89      75      95  English
2      79      64      86  English
3      73      81      45     Math
4      50      95      58     Math
5      97      74      66     Math

# Part 5: Merging Data

- Sometimes we may need to merge two dataset according to some key columns.
- Here, we introduce 3 simple merging methods: one-to-one, many-to-one and many-to-many.

![join methods](images/Join_Merge_SAS.png)

### Merge data in Pandas

- We can use **`pd.merge(dataframe1, dataframe2)`** or **`dataframe1.merge(dataframe2)`** to perform the above 3 merging methods.

In [39]:
users_plan = pd.DataFrame({'User': ['Kevin', 'Belle', '國維', '黃和', 'Alicia'],
                    'Plan': ['family plan', 'individual plan', 'individual plan', 'free', 'free']})
users_join = pd.DataFrame({'User': ['Kevin', 'Belle', '國維', '黃和', 'Alicia'],
                    'JoinYear': [2013, 2014, 2015, 2016, 2017]})

display(users_plan, users_join)

              Plan    User
0      family plan   Kevin
1  individual plan   Belle
2  individual plan      國維
3             free      黃和
4             free  Alicia

   JoinYear    User
0      2013   Kevin
1      2014   Belle
2      2015      國維
3      2016      黃和
4      2017  Alicia

## 5-1: One-to-one join

- This is the simplest merging method and it is very similar to concatenation.
- The `pd.merge()` function will automatically look for the same column as key to merge the two dataset.

In [40]:
# one-to-one join by 'User' column

users_info1 = pd.merge(users_plan, users_join)
display(users_info1)

              Plan    User  JoinYear
0      family plan   Kevin      2013
1  individual plan   Belle      2014
2  individual plan      國維      2015
3             free      黃和      2016
4             free  Alicia      2017

### Specify merge key

- If you want to sepcify a column to be used as key, set `on = your_merge_key` to specify the key.

In [41]:
users_info1 = pd.merge(users_plan, users_join, on='User')
display(users_info1)

              Plan    User  JoinYear
0      family plan   Kevin      2013
1  individual plan   Belle      2014
2  individual plan      國維      2015
3             free      黃和      2016
4             free  Alicia      2017

### Sepcify merge key in each datafame

- If the column names are different in the two DataFrame, use `left_on = left_key` and `right_on = right_key` to specify the merge key in each dataframe.

In [42]:
test1 = pd.DataFrame({'User': ['Kevin', 'Belle', '國維', '黃和', 'Alicia'],
                    'Plan': ['family plan', 'individual plan', 'individual plan', 'free', 'free']})

# change 'User' to 'UserName'
test2 = pd.DataFrame({'UserName': ['Kevin', 'Belle', '國維', '黃和', 'Alicia'],
                    'JoinYear': [2013, 2014, 2015, 2016, 2017]})

display(test1, test2)

              Plan    User
0      family plan   Kevin
1  individual plan   Belle
2  individual plan      國維
3             free      黃和
4             free  Alicia

   JoinYear UserName
0      2013    Kevin
1      2014    Belle
2      2015       國維
3      2016       黃和
4      2017   Alicia

In [43]:
# error
pd.merge(test1, test2)

MergeError: No common columns to perform merge on

In [44]:
demo = pd.merge(test1, test2, left_on='User', right_on='UserName')
display(demo)

              Plan    User  JoinYear UserName
0      family plan   Kevin      2013    Kevin
1  individual plan   Belle      2014    Belle
2  individual plan      國維      2015       國維
3             free      黃和      2016       黃和
4             free  Alicia      2017   Alicia

## 5-2: Many-to-one join

- One of the key column contains duplicate entires.
- `pd.merge()` will preserve the duplicate entires automatically.

In [45]:
# many-to-one join by 'Plan' column

subscribe = pd.DataFrame({'Plan': ['family plan', 'individual plan', 'free'],
                          'Subscription': ['Yes', 'Yes', 'No']})

users_info2 = users_info1.merge(subscribe)
display(users_info2)

              Plan    User  JoinYear Subscription
0      family plan   Kevin      2013          Yes
1  individual plan   Belle      2014          Yes
2  individual plan      國維      2015          Yes
3             free      黃和      2016           No
4             free  Alicia      2017           No

## 5-3: Many-to-many join

- Both key columns contains duplicate entires.
- Likewise, `pd.merge()` will preserve duplicate entires in both columns.

In [46]:
# many-to-many join by 'Plan' column

benefits = pd.DataFrame({'Plan': ['family plan', 'family plan', 'individual plan', 'individual plan', 'free'],
                         'Benefits': ['5 devices', 'download', '1 device', 'download', '1 device']})

users_info3 = users_info2.merge(benefits)
display(users_info3)

              Plan    User  JoinYear Subscription   Benefits
0      family plan   Kevin      2013          Yes  5 devices
1      family plan   Kevin      2013          Yes   download
2  individual plan   Belle      2014          Yes   1 device
3  individual plan   Belle      2014          Yes   download
4  individual plan      國維      2015          Yes   1 device
5  individual plan      國維      2015          Yes   download
6             free      黃和      2016           No   1 device
7             free  Alicia      2017           No   1 device

# Part 6: Exercise - Boston Housing Data

```text
Boston House Prices dataset
===========================
Data Set Characteristics:  

    :Number of Instances: 506 
    :Number of Attributes: 13 numeric/categorical predictive
    :Median Value (attribute 14) is usually the target
    :Attribute Information (in order):
        - CRIM     per capita crime rate by town
        - ZN       proportion of residential land zoned for lots over 25,000 sq.ft.
        - INDUS    proportion of non-retail business acres per town
        - CHAS     Charles River dummy variable (= 1 if tract bounds river; 0 otherwise)
        - NOX      nitric oxides concentration (parts per 10 million)
        - RM       average number of rooms per dwelling
        - AGE      proportion of owner-occupied units built prior to 1940
        - DIS      weighted distances to five Boston employment centres
        - RAD      index of accessibility to radial highways
        - TAX      full-value property-tax rate per $10,000
        - PTRATIO  pupil-teacher ratio by town
        - B        1000(Bk - 0.63)^2 where Bk is the proportion of blacks by town
        - LSTAT    % lower status of the population
        - MEDV     Median value of owner-occupied homes in $1000's

    :Missing Attribute Values: None
    :Creator: Harrison, D. and Rubinfeld, D.L.
```

### Read Data from CSV

>```text
Read in boston house price data from csv file.
File name = boston_dataset.csv
There is no header in this file
```

In [49]:
# Exercise 1

### your code here ###
boston_data = pd.read_csv('data/boston_dataset.csv', header=None)

In [50]:
# Test cell: Exercise 1

# Inspect data
boston_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33

### Set column names

>```text
Since we have no column headers, please set column names for this dataset.
```

In [51]:
# Exercise 2

columns = ['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO', 'B', 'LSTAT']

### your code here ###
boston_data.columns = columns

In [52]:
# Test Cell: Exercise 2

boston_data.tail()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
501,0.06263,0.0,11.93,0.0,0.573,6.593,69.1,2.4786,1.0,273.0,21.0,391.99,9.67
502,0.04527,0.0,11.93,0.0,0.573,6.120,76.7,2.2875,1.0,273.0,21.0,396.90,9.08
503,0.06076,0.0,11.93,0.0,0.573,6.976,91.0,2.1675,1.0,273.0,21.0,396.90,5.64
504,0.10959,0.0,11.93,0.0,0.573,6.794,89.3,2.3889,1.0,273.0,21.0,393.45,6.48
505,0.04741,0.0,11.93,0.0,0.573,6.030,80.8,2.5050,1.0,273.0,21.0,396.90,7.88

### Houses Next to Charles River

In [53]:
# Charles River dummy variable (= 1 if tract bounds river; 0 otherwise)

### your code here ###
river_dummy = boston_data['CHAS']       # column name: CHAS
next_to_river = np.sum(river_dummy)     # how many are next to river
######################

percent = (next_to_river / boston_data.shape[0]) * 100

print('Houses next to the beautiful Charles River:', next_to_river)
print('But... It is only %.2f percent.' %percent)

Houses next to the beautiful Charles River: 35.0
But... It is only 6.92 percent.

### Average number of rooms per dwelling

In [54]:
# average number of rooms per dwelling

### your code here ###
room = boston_data['RM']    # column name: RM
min_room = room.min()       # the minimum  
avg_room = room.mean()      # the average 
max_room = room.max()       # the maximum
######################

print('Min:', min_room)
print('Mean:', avg_room)
print('Max:', max_room)

Min: 3.561
Mean: 6.28463438735
Max: 8.78